// -----------------------------------------------------------1----------------------------------------------------------------------------------
let num = prompt("Введите число");
num == 10 ? console.log("Верно") : console.log("Не верно");
// -----------------------------------------------------------2----------------------------------------------------------------------------------
let dom = prompt("Введите номер квартиры");
if (dom <= 20) {
  console.log("Подъезд-1");
} else if (dom <= 48) {
  console.log("Подъезд-2");
} else if (dom <= 90) {
  console.log("Подъезд-3");
} else {
  console.log("Такого номер квартиры нет!");
}
// -----------------------------------------------------------3----------------------------------------------------------------------------------
let number = prompt("Введите число от 0 до 5");
if (number >= 0 && number <= 5) {
  console.log("Верно");
} else {
  console.log("Не верно");
}
// -----------------------------------------------------------4,5--------------------------------------------------------------------------------
let time = prompt("Текущее время?");
const userName = "Агай";
if (time >= 6 && time <= 12) {
  console.log("Доброе утро," + userName);
} else if (time >= 13 && time <= 17) {
  console.log("Добрый день!" + userName);
} else {
  console.log("Добрый вечер!" + userName);
}
// -----------------------------------------------------------6----------------------------------------------------------------------------------
let age = prompt("Сколько вам лет?");
if (age <= 6 || (age >= 6 && age <= 65)) {
  console.log("Скидка");
} else {
  console.log("Нет скидки");
}
// -----------------------------------------------------------7----------------------------------------------------------------------------------
let player1 = prompt("'Первый игрок' Введите ножницы или бумага, камень: ");
let player2 = prompt("'Второй игрок' Введите ножницы или бумага, камень: ");
if (player1 == "ножницы" && player2 == "ножницы") {
  console.log("Ничья");
} else if (player1 == "бумага" && player2 == "бумага") {
  console.log("Ничья");
} else if (player1 == "камень" && player2 == "камень") {
  console.log("Ничья");
} else if (player1 == "ножницы" && player2 == "бумага") {
  console.log("Выйграл номер 1");
} else if (player1 == "бумага" && player2 == "ножницы") {
  console.log("Выйграл номер 2");
} else if (player1 == "камень" && player2 == "бумага") {
  console.log("Выйграл номер 2");
} else if (player1 == "бумага" && player2 == "камень") {
  console.log("Выйграл номер 1");
} else if (player1 == "ножницы" && player2 == "камень") {
  console.log("Выйграл номер 2");
} else if (player2 == "ножницы" && player1 == "камень") {
  console.log("Выйграл номер 1");
} else {
  console.log("Чык эшке");
}
// -----------------------------------------------------------8----------------------------------------------------------------------------------
const number1 = 7;
if (number1 % 2 === 0) {
  console.log("Число чётное");
} else {
  console.log("Число нечётное");
}
//?  number1 % 2 - бул менен остатак ты издеп атабыс, остаток === 0 - Остаток строго 0 болуп калса, анда number1-четный, же number1-0,0000001 болуп калса, анда не четный, ан кени ал 0 болбойтат
// -----------------------------------------------------------9----------------------------------------------------------------------------------
let num5 = 5;
num5 == 5 ? console.log("Five") : console.log("Не Five");
// -----------------------------------------------------------10 Балл койгула)-------------------------------------------------------------------